---
kind: property
id: P:Autodesk.Revit.DB.CompoundStructureLayer.DeckEmbeddingType
source: html/a42d8678-ec33-faef-de00-371c5bda10c9.htm
---
# Autodesk.Revit.DB.CompoundStructureLayer.DeckEmbeddingType Property

Embedding type for structural deck - only for a layer whose function is StructuralDeck.

## Syntax (C#)
```csharp
public StructDeckEmbeddingType DeckEmbeddingType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration